In [1]:
import pandas as pd
import numpy as np
file = "NYPD DATA.csv"

In [2]:
db = pd.read_csv(file)
db.head()

,ID,Boroughs,Boroughs_ID,Crime_Category,Crime_Sub_Category,Crime_Location,Date
0,1,BROOKLYN,1.0,MISDEMEANOR,"WEAPONS, POSSESSION, ETC",STREET,3/31/2018
1,2,STATEN ISLAND,5.0,FELONY,RAPE 2,RESIDENCE - PUBLIC HOUSING,3/31/2018
2,3,QUEENS,4.0,MISDEMEANOR,AGGRAVATED HARASSMENT 2,RESIDENCE-HOUSE,3/31/2018
3,4,QUEENS,4.0,FELONY,"ROBBERY,DELIVERY PERSON",RESIDENCE - APT. HOUSE,3/31/2018
4,5,BROOKLYN,1.0,VIOLATION,"HARASSMENT,SUBD 3,4,5",RESIDENCE - PUBLIC HOUSING,3/31/2018

In [30]:
crime_count = db.groupby('Boroughs')["Crime_Category"].count()
crime_count

Boroughs
BRONX            24320
BROOKLYN         32222
MANHATTAN        27445
QUEENS           20653
STATEN ISLAND     4843
Name: Crime_Category, dtype: int64

In [40]:
misdemeanor = db.loc[db["Crime_Category"]=="MISDEMEANOR"]
misdemeanor_count = misdemeanor.groupby("Boroughs")["Crime_Category"].count()
misdemeanor_count

Boroughs
BRONX            14088
BROOKLYN         17338
MANHATTAN        15601
QUEENS           10873
STATEN ISLAND     2685
Name: Crime_Category, dtype: int64

In [42]:
violation = db.loc[db["Crime_Category"]=="VIOLATION"]
violation_count = violation.groupby("Boroughs")["Crime_Category"].count()
violation_count

Boroughs
BRONX            3927
BROOKLYN         4762
MANHATTAN        3281
QUEENS           3269
STATEN ISLAND    1022
Name: Crime_Category, dtype: int64

In [ ]:
felony = db.loc[db["Crime_Category"]=="FELONY"]
felony_count = felony.groupby("Boroughs")["Crime_Category"].count()
felony_count

In [87]:
boroughs_id = [2, 1, 3, 4, 5]
crime_sum = pd.DataFrame({"Boroughs_ID": boroughs_id,
                         "Total Crime": crime_count,
                         "Misdeameanors": misdemeanor_count,
                         "Violations":violation_count,
                         "Felony": felony_count})
crime_sum

               Boroughs_ID  Total Crime  Misdeameanors  Violations  Felony
Boroughs
BRONX                    2        24320          14088        3927    6305
BROOKLYN                 1        32222          17338        4762   10122
MANHATTAN                3        27445          15601        3281    8563
QUEENS                   4        20653          10873        3269    6511
STATEN ISLAND            5         4843           2685        1022    1136

In [63]:
airbnb_file = "listings_summary.csv"
airbnb_db = pd.read_csv(airbnb_file)
airbnb_db.head()

,id,name,host_id,host_name,neighbourhood_group,neighbourhood,latitude,longitude,room_type,price,minimum_nights,number_of_reviews,last_review,reviews_per_month,calculated_host_listings_count,availability_365
0,18461891,"Bright, comfortable 1B studio near everything!",916092,Connie Mae,Queens,Ditmars Steinway,40.774142,-73.916246,Entire home/apt,110,6,0,NaN,NaN,1,0
1,20702398,Quiet house on City Island,1457680,James,Bronx,City Island,40.849191,-73.786509,Private room,50,1,2,10/1/2017,2.00,1,169
2,6627449,Large 1 BDRM in Great location,13886510,Arlene,Bronx,City Island,40.849775,-73.786609,Entire home/apt,125,3,21,9/26/2017,0.77,1,363
3,19949243,Stay aboard a sailboat,1149260,MoMo,Bronx,City Island,40.848838,-73.782276,Entire home/apt,100,3,0,NaN,NaN,1,90
4,1886820,Quaint City Island Community.,9815788,Steve,Bronx,City Island,40.841144,-73.783052,Entire home/apt,300,7,0,NaN,NaN,1,365

In [64]:
airbnb_db = airbnb_db.drop(columns=["latitude", "longitude", "calculated_host_listings_count", "minimum_nights", "room_type"])
airbnb_db = airbnb_db.dropna()
airbnb_db = airbnb_db.rename(columns = {"neighbourhood_group": "Boroughs"})

In [65]:
airbnb_db.head()

,id,name,host_id,host_name,Boroughs,neighbourhood,price,number_of_reviews,last_review,reviews_per_month,availability_365
1,20702398,Quiet house on City Island,1457680,James,Bronx,City Island,50,2,10/1/2017,2.00,169
2,6627449,Large 1 BDRM in Great location,13886510,Arlene,Bronx,City Island,125,21,9/26/2017,0.77,363
5,5557381,Quaint City Island Home,28811542,Phoebe,Bronx,City Island,69,94,7/31/2017,3.27,325
6,19609887,Sweet Getaway,137892083,Gladis,Bronx,City Island,150,3,9/24/2017,1.58,74
7,7949480,City Island Sanctuary BR & Private Bath w Parking,119445,Linda & Didier,Bronx,City Island,101,31,9/1/2017,1.49,179

In [66]:
airbnb_db = airbnb_db.rename(columns = {"id": "listing_id"})

In [67]:
airbnb_db ["Boroughs_ID"] = np.where(airbnb_db["Boroughs"]=="Bronx", '2.0', 
                            np.where(airbnb_db["Boroughs"]=="Queens", '4.0',
                            np.where(airbnb_db["Boroughs"]=="Brooklyn", '1.0',
                            np.where(airbnb_db["Boroughs"]=="Manhattan", '3.0',
                            np.where(airbnb_db["Boroughs"]=="Staten Island", '5.0', "0")))))

In [68]:
airbnb_db.dtypes

listing_id             int64
name                  object
host_id                int64
host_name             object
Boroughs              object
neighbourhood         object
price                  int64
number_of_reviews      int64
last_review           object
reviews_per_month    float64
availability_365       int64
Boroughs_ID           object
dtype: object

In [69]:
airbnb_db["Boroughs_ID"] = airbnb_db ["Boroughs_ID"].astype(float)
airbnb_db["price"] = airbnb_db ["price"].astype(int)
airbnb_db.head()

,listing_id,name,host_id,host_name,Boroughs,neighbourhood,price,number_of_reviews,last_review,reviews_per_month,availability_365,Boroughs_ID
1,20702398,Quiet house on City Island,1457680,James,Bronx,City Island,50,2,10/1/2017,2.00,169,2.0
2,6627449,Large 1 BDRM in Great location,13886510,Arlene,Bronx,City Island,125,21,9/26/2017,0.77,363,2.0
5,5557381,Quaint City Island Home,28811542,Phoebe,Bronx,City Island,69,94,7/31/2017,3.27,325,2.0
6,19609887,Sweet Getaway,137892083,Gladis,Bronx,City Island,150,3,9/24/2017,1.58,74,2.0
7,7949480,City Island Sanctuary BR & Private Bath w Parking,119445,Linda & Didier,Bronx,City Island,101,31,9/1/2017,1.49,179,2.0

In [88]:
listing_sum = airbnb_db.groupby("Boroughs")["listing_id"].count()
price = airbnb_db.groupby("Boroughs")["price"].mean()
reviews = airbnb_db.groupby("Boroughs")["number_of_reviews"].sum()
boroughs_id = [2, 1, 3, 4, 5]
boroughs = ["Bronx", "Brooklyn", "Manhattan", "Queens", "Staten Island"]

In [96]:
airbnb_sum = pd.DataFrame({"Boroughs": boroughs,
                        "Boroughs_ID": boroughs_id,
                         "Average_Price": price,
                         "Reviews": reviews,
                        })

airbnb_sum

                    Boroughs  Boroughs_ID  Average_Price  Reviews
Boroughs
Bronx                  Bronx            2      70.202680    13418
Brooklyn            Brooklyn            1     117.657800   319378
Manhattan          Manhattan            3     176.247394   373163
Queens                Queens            4      96.021208    87084
Staten Island  Staten Island            5      93.239819     6194

In [97]:
airbnb_crime = pd.merge(airbnb_sum, crime_sum, how = "inner", on = "Boroughs_ID")
airbnb_crime

,Boroughs,Boroughs_ID,Average_Price,Reviews,Total Crime,Misdeameanors,Violations,Felony
0,Bronx,2,70.202680,13418,24320,14088,3927,6305
1,Brooklyn,1,117.657800,319378,32222,17338,4762,10122
2,Manhattan,3,176.247394,373163,27445,15601,3281,8563
3,Queens,4,96.021208,87084,20653,10873,3269,6511
4,Staten Island,5,93.239819,6194,4843,2685,1022,1136

In [98]:
airbnb_crime["Average_Price"] = airbnb_crime ["Average_Price"].map("${:,.2f}".format)
airbnb_crime

,Boroughs,Boroughs_ID,Average_Price,Reviews,Total Crime,Misdeameanors,Violations,Felony
0,Bronx,2,$70.20,13418,24320,14088,3927,6305
1,Brooklyn,1,$117.66,319378,32222,17338,4762,10122
2,Manhattan,3,$176.25,373163,27445,15601,3281,8563
3,Queens,4,$96.02,87084,20653,10873,3269,6511
4,Staten Island,5,$93.24,6194,4843,2685,1022,1136